Revit 2027 API
CurtainSystem.RemoveCurtainGrid Method
Remove CurtainGrid from the specified face for the CurtainSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveCurtainGrid(
	Reference face
)
Public Sub RemoveCurtainGrid (
	face As Reference
)
public:
void RemoveCurtainGrid(
	Reference^ face
)
member RemoveCurtainGrid :
        face : Reference -> unit
Parameters
face Reference
The face CurtainGrid will be removed from.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input parameter face is null.
InvalidOperationException |  Thrown when the CurtainGrid cannot be removed from the specified face or regenerate fails.
See Also
Reference
CurtainSystem Class
Autodesk.Revit.DB Namespace